# Brew file for linux and mac

# Basics {{{
cask "kitty"
brew "neovim"
brew "fd"
brew "starship"
brew "zoxide" # z change directory
brew "gh"
brew "lazygit"
brew "jq"
brew "node"
brew "yarn"
brew "python3"
brew "tree"
brew "htop"

brew "git-remote-gcrypt" # for encrypted repo
brew "golang"

# }}}

# Mac {{{
if OS.mac?
    # see https://github.com/koekeishiya/yabai for installation steps on mac
    brew "koekeishiya/formulae/yabai" # window manager
    brew "koekeishiya/formulae/skhd" # shortcuts
    cask "mouse-fix" # mouse scrolling fix & button remap
    brew "bash" # need newest bash for some program like extracto
else
    # linux ones
end
# }}}

cask "google-chrome"

# Fonts {{{
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-fira-mono"
# }}}


# ( vim: set ts=4 sw=4 et fdm=marker: )
